Tekla Open API Reference for Tekla Structures 2025
Task.RemoveObjectsFromTask Method
 Removes objects from the task.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool RemoveObjectsFromTask(
	ArrayList ModelObjects
)
Public Function RemoveObjectsFromTask (
	ModelObjects As ArrayList
) As Boolean
Parameters
ModelObjects
Type: System.Collections.ArrayList
An array list of model objects to be removed from the task.
Return Value
Type: Boolean
True on success.
Examples
using Tekla.Structures.Model;
using Tekla.Structures;
using System.Collections;
public class Example
{
       public void Example1()
       {
           Identifier Identifier1 = new Identifier(357);
           // Remove all the children from the task.
           Task task = new Task(Identifier1);
           if (task.Select())
           {
               ModelObjectEnumerator taskChildren = task.GetChildren();
               ArrayList objectsToRemove = new ArrayList();
               while (taskChildren.Current != null)
               objectsToRemove.Add(taskChildren.Current);
               task.RemoveObjectsFromTask(objectsToRemove);
           }
       }
}
See Also
Reference
Task Class
Tekla.Structures.Model Namespace